In [14]:
# import our package
import sqlite3

In [15]:
# create our table info
query = ''' 
CREATE TABLE info( first_name VARCHAR(20), last_name VARCHAR(20),
salary REAL , age INTEGER );
'''

In [16]:
# create our conncetion
con = sqlite3.connect('mydata.sqlite')

In [17]:
# exceute oue query to create table
con.execute(query)

In [18]:
con.commit()

In [19]:
# create our data
data = [('karim','akarkab',1400.12,30),
        ('jo','banham',1200.20,28),
        ('mahdra','anita',2500.30,35),
        ('kris','nik',3600.60,40)]

In [20]:
smt = "INSERT INTO info VALUES(?,?,?,?)"

In [21]:
# store the data in our table
con.executemany(smt,data)

In [22]:
con.commit()

In [23]:
cursor = con.execute('select * from info')

In [24]:
rows = cursor.fetchall()

In [25]:
rows

[('karim', 'akarkab', 1400.12, 30),
 ('jo', 'banham', 1200.2, 28),
 ('mahdra', 'anita', 2500.3, 35),
 ('kris', 'nik', 3600.6, 40)]

In [26]:
cursor.description

(('first_name', None, None, None, None, None, None),
 ('last_name', None, None, None, None, None, None),
 ('salary', None, None, None, None, None, None),
 ('age', None, None, None, None, None, None))

In [27]:
import pandas as pd

In [28]:
pd.DataFrame(rows,columns=[x[0] for x in cursor.description])

  first_name last_name   salary  age
0      karim   akarkab  1400.12   30
1         jo    banham  1200.20   28
2     mahdra     anita  2500.30   35
3       kris       nik  3600.60   40

In [29]:
import sqlalchemy

In [30]:
db = sqlalchemy.create_engine('sqlite:///mydata.sqlite')

In [31]:
pd.read_sql('select * from info',db)

  first_name last_name   salary  age
0      karim   akarkab  1400.12   30
1         jo    banham  1200.20   28
2     mahdra     anita  2500.30   35
3       kris       nik  3600.60   40